[
    {
        "id": 2,
        "title": "Frontend Developer",
        "companyId": 2,
        "minimumSalary": 7000000,
        "maximumSalary": 12000000,
        "minimumExperience": 1,
        "maximumExperience": 4,
        "postDate": "2023-03-19T00:00:00.000Z",
        "category": "Technology",
        "authorId": 1,
        "jobType": "Full Time",
        "description": "Design and implement user-facing features for our web applications using modern front-end frameworks and libraries. Collaborate with cross-functional teams to design and develop new features, and ensure the technical feasibility of UI/UX designs. Optimize front-end code for maximum speed and scalability. Develop reusable code and libraries for future use. Ensure the technical feasibility of UI/UX designs. Write and maintain technical documentation. The ideal candidate should have a Bachelor's degree in Computer Science or a related field and at least [Insert number] years of experience in front-end development. They should have strong proficiency in HTML, CSS, and JavaScript, as well as experience working with modern front-end frameworks such as React, Angular, or Vue.js. The candidate should possess excellent problem-solving and analytical skills, strong communication and teamwork skills. Familiarity with server-side technologies such as Node.js or Ruby on Rails is a plus.",
        "createdAt": "2023-03-19T10:51:52.550Z",
        "updatedAt": "2023-03-19T10:51:52.550Z",
        "User": {
            "id": 1,
            "username": "admin1",
            "email": "admin@mail.com",
            "role": null,
            "address": "Jakarta",
            "createdAt": "2023-03-19T10:51:52.450Z",
            "updatedAt": "2023-03-19T10:51:52.450Z"
        },
        "Company": {
            "id": 2,
            "name": "Tokovids",
            "companyLogo": "https://assets.tokopedia.net/assets-tokopedia-lite/v2/arael/kratos/36c1015e.png",
            "location": "Jakarta",
            "email": "toko@mail.com",
            "description": "We are an online shop unicorn that provides an easy-to-use platform for businesses of all sizes to sell their products online. Our platform allows businesses to create and customize their own online store with just a few clicks, and we provide a range of tools and features to help them manage their store, process orders, and accept payments. We also offer a range of marketing and analytics tools to help businesses grow their online presence and reach new customers. Our mission is to make e-commerce accessible to everyone, and we're passionate about helping businesses of all sizes succeed in the digital world. Whether you're just starting out or looking to take your business to the next level, Shopify is here to help you succeed.",
            "createdAt": "2023-03-19T10:51:52.542Z",
            "updatedAt": "2023-03-21T06:14:00.333Z"
        },
        "Skills": [
            {
                "id": 2,
                "jobId": 2,
                "name": "Golang",
                "level": "Intermediate",
                "createdAt": "2023-03-19T10:51:52.562Z",
                "updatedAt": "2023-03-19T10:51:52.562Z"
            },
            {
                "id": 9,
                "jobId": 2,
                "name": "React",
                "level": "Advance",
                "createdAt": "2023-03-19T10:51:52.562Z",
                "updatedAt": "2023-03-19T10:51:52.562Z"
            }
        ],
        "updatedDate": "19 Maret 2023",
        "minimumSalaryFormatted": "7.000.000",
        "maximumSalaryFormatted": "12.000.000"
    },
    {
        "id": 3,
        "title": "IOS Developer",
        "companyId": 3,
        "minimumSalary": 10000000,
        "maximumSalary": 18000000,
        "minimumExperience": 5,
        "maximumExperience": 10,
        "postDate": "2023-03-19T00:00:00.000Z",
        "category": "Technology",
        "authorId": 1,
        "jobType": "Full Time",
        "description": "Design and develop native iOS applications for our clients using Swift and Objective-C. Collaborate with cross-functional teams to design and implement new features. Write clean, maintainable, and efficient code. Ensure the performance, quality, and responsiveness of applications. Identify and correct bottlenecks and fix bugs. Stay up-to-date with new technologies and trends in iOS development. Write and maintain technical documentation. The ideal candidate should have a Bachelor's degree in Computer Science or a related field and at least [Insert number] years of experience in iOS development. They should have strong proficiency in Swift and Objective-C, as well as experience working with iOS frameworks such as UIKit, Core Data, and Core Animation. The candidate should possess excellent problem-solving and analytical skills, strong communication and teamwork skills. Familiarity with RESTful APIs, Git, and Agile development methodologies is a plus.",
        "createdAt": "2023-03-19T10:51:52.550Z",
        "updatedAt": "2023-03-19T10:51:52.550Z",
        "User": {
            "id": 1,
            "username": "admin1",
            "email": "admin@mail.com",
            "role": null,
            "address": "Jakarta",
            "createdAt": "2023-03-19T10:51:52.450Z",
            "updatedAt": "2023-03-19T10:51:52.450Z"
        },
        "Company": {
            "id": 3,
            "name": "Bukalapar",
            "companyLogo": "https://companieslogo.com/img/orig/BUKA.JK-25d1a629.png?t=1651810819",
            "location": "Jakarta",
            "email": "buka@mail.com",
            "description": "Bukalapar is an e-commerce platform that offers a simple and user-friendly solution for businesses of all sizes to sell their products online. With Shopify, businesses can easily create their own customizable online store, and we provide a range of features and tools to help them manage their store, handle orders, and process payments. In addition, we offer various marketing and analytics tools to help businesses boost their online presence and attract new customers. At Shopify, we are committed to democratizing e-commerce and helping businesses of all sizes succeed in the digital world. Whether you are a budding entrepreneur or a well-established business, Shopify is here to assist you in achieving your online selling goals.",
            "createdAt": "2023-03-19T10:51:52.542Z",
            "updatedAt": "2023-03-19T10:51:52.542Z"
        },
        "Skills": [
            {
                "id": 3,
                "jobId": 3,
                "name": "Swift",
                "level": "Advance",
                "createdAt": "2023-03-19T10:51:52.562Z",
                "updatedAt": "2023-03-19T10:51:52.562Z"
            }
        ],
        "updatedDate": "19 Maret 2023",
        "minimumSalaryFormatted": "10.000.000",
        "maximumSalaryFormatted": "18.000.000"
    },
    {
        "id": 4,
        "title": "Product Manager",
        "companyId": 4,
        "minimumSalary": 15000000,
        "maximumSalary": 20000000,
        "minimumExperience": 4,
        "maximumExperience": 8,
        "postDate": "2023-03-19T00:00:00.000Z",
        "category": "Technology",
        "authorId": 1,
        "jobType": "Full Time",
        "description": "Define the product strategy and roadmap for our company's products. Work closely with cross-functional teams, including engineering, design, sales, and marketing, to drive product development and ensure successful product launches. Conduct market research and gather customer feedback to understand customer needs and preferences. Prioritize features and make data-driven decisions to drive product development. Define product requirements, write user stories, and create product specifications. Collaborate with designers and engineers to create wireframes, mockups, and prototypes. Write and maintain technical documentation. The ideal candidate should have a Bachelor's degree in Computer Science, Engineering, Business, or a related field, and at least [Insert number] years of experience in product management. They should have strong analytical skills, excellent problem-solving and communication skills, as well as experience working with Agile methodologies. The candidate should be able to demonstrate a successful track record of shipping products and driving product growth. Experience working in SaaS or B2B companies is a plus.",
        "createdAt": "2023-03-19T10:51:52.550Z",
        "updatedAt": "2023-03-19T10:51:52.550Z",
        "User": {
            "id": 1,
            "username": "admin1",
            "email": "admin@mail.com",
            "role": null,
            "address": "Jakarta",
            "createdAt": "2023-03-19T10:51:52.450Z",
            "updatedAt": "2023-03-19T10:51:52.450Z"
        },
        "Company": {
            "id": 4,
            "name": "Xenpai",
            "companyLogo": "https://s3.amazonaws.com/beamstart/2021/Sep/15/46c2406db65b215c4a5f95a6dc2c6edf.jpeg",
            "location": "Bandung",
            "email": "xenpai@mail.com",
            "description": "Xenpai is a leading payment gateway company that offers secure and reliable payment processing solutions for businesses of all sizes. Our platform provides a seamless payment experience for customers, allowing them to pay quickly and easily without any hassle. We support various payment methods, including credit and debit cards, digital wallets, and bank transfers. In addition, our advanced fraud prevention measures ensure that transactions are secure and protected against fraudsters. At PayGate, we are dedicated to delivering exceptional service and support to our customers, and we strive to make payment processing as simple and efficient as possible. Whether you are an e-commerce business, a brick-and-mortar store, or a large enterprise, PayGate is here to help you streamline your payment processing and grow your business.",
            "createdAt": "2023-03-19T10:51:52.542Z",
            "updatedAt": "2023-03-19T10:51:52.542Z"
        },
        "Skills": [
            {
                "id": 4,
                "jobId": 4,
                "name": "Management",
                "level": "Advance",
                "createdAt": "2023-03-19T10:51:52.562Z",
                "updatedAt": "2023-03-19T10:51:52.562Z"
            }
        ],
        "updatedDate": "19 Maret 2023",
        "minimumSalaryFormatted": "15.000.000",
        "maximumSalaryFormatted": "20.000.000"
    },
    {
        "id": 5,
        "title": "Business Development",
        "companyId": 5,
        "minimumSalary": 5000000,
        "maximumSalary": 11000000,
        "minimumExperience": 1,
        "maximumExperience": 3,
        "postDate": "2023-03-19T00:00:00.000Z",
        "category": "Technology",
        "authorId": 1,
        "jobType": "Full Time",
        "description": "Develop and implement business development strategies to identify and pursue new business opportunities. Build and maintain relationships with key stakeholders, including customers, partners, and industry influencers. Conduct market research to identify emerging trends and opportunities. Collaborate with cross-functional teams to develop and execute marketing campaigns and sales initiatives. Prepare proposals, presentations, and other sales materials. Negotiate and close deals with customers and partners. Meet or exceed sales targets and revenue goals. Write and maintain technical documentation. The ideal candidate should have a Bachelor's degree in Business, Marketing, or a related field, and at least [Insert number] years of experience in business development, sales, or marketing. They should have strong analytical and problem-solving skills, excellent communication and negotiation skills, as well as experience working with SaaS or B2B companies. The candidate should be able to demonstrate a successful track record of building and maintaining relationships with customers and partners, and exceeding sales targets.",
        "createdAt": "2023-03-19T10:51:52.550Z",
        "updatedAt": "2023-03-19T10:51:52.550Z",
        "User": {
            "id": 1,
            "username": "admin1",
            "email": "admin@mail.com",
            "role": null,
            "address": "Jakarta",
            "createdAt": "2023-03-19T10:51:52.450Z",
            "updatedAt": "2023-03-19T10:51:52.450Z"
        },
        "Company": {
            "id": 5,
            "name": "JULID",
            "companyLogo": "https://w7.pngwing.com/pngs/112/892/png-transparent-loan-finance-julo-unsecured-debt-bank-bank-game-company-text.png",
            "location": "Surabaya",
            "email": "julo@mail.com",
            "description": "JULID is a leading credit company that provides fast and easy access to credit for individuals and businesses. Our platform offers a range of credit options, including personal loans, business loans, and credit cards, with flexible terms and competitive interest rates. We use advanced technology and data analytics to assess creditworthiness quickly and accurately, enabling us to approve and disburse loans in as little as 24 hours. In addition, we provide personalized guidance and support to help our customers make informed decisions and achieve their financial goals. At CreditNow, we are committed to providing fair and transparent credit solutions that empower our customers and help them thrive. Whether you need funds for a personal project or a business expansion, CreditNow is here to help you access the credit you need, when you need it.",
            "createdAt": "2023-03-19T10:51:52.542Z",
            "updatedAt": "2023-03-19T10:51:52.542Z"
        },
        "Skills": [
            {
                "id": 5,
                "jobId": 5,
                "name": "Business Acumen",
                "level": "Beginner",
                "createdAt": "2023-03-19T10:51:52.562Z",
                "updatedAt": "2023-03-19T10:51:52.562Z"
            }
        ],
        "updatedDate": "19 Maret 2023",
        "minimumSalaryFormatted": "5.000.000",
        "maximumSalaryFormatted": "11.000.000"
    },
    {
        "id": 6,
        "title": "Marketing Manager",
        "companyId": 6,
        "minimumSalary": 25000000,
        "maximumSalary": 35000000,
        "minimumExperience": 8,
        "maximumExperience": 10,
        "postDate": "2023-03-19T00:00:00.000Z",
        "category": "Business",
        "authorId": 1,
        "jobType": "Full Time",
        "description": "Develop and implement marketing strategies to promote our company's products and services. Collaborate with cross-functional teams, including product management, sales, and design, to develop and execute marketing campaigns. Conduct market research to identify emerging trends and opportunities. Manage and oversee the company's social media presence and online reputation. Create and manage email marketing campaigns, including newsletters and promotional emails. Write and edit marketing copy for websites, social media, and other marketing materials. Measure and analyze the effectiveness of marketing campaigns and adjust strategies accordingly. Write and maintain technical documentation. The ideal candidate should have a Bachelor's degree in Marketing, Communications, or a related field, and at least [Insert number] years of experience in marketing, with a focus on digital marketing. They should have strong analytical and problem-solving skills, excellent communication and project management skills, as well as experience with social media management and email marketing tools. The candidate should be able to demonstrate a successful track record of developing and executing marketing campaigns and improving customer engagement.",
        "createdAt": "2023-03-19T10:51:52.550Z",
        "updatedAt": "2023-03-19T10:51:52.550Z",
        "User": {
            "id": 1,
            "username": "admin1",
            "email": "admin@mail.com",
            "role": null,
            "address": "Jakarta",
            "createdAt": "2023-03-19T10:51:52.450Z",
            "updatedAt": "2023-03-19T10:51:52.450Z"
        },
        "Company": {
            "id": 6,
            "name": "Shomay",
            "companyLogo": "https://www.freepnglogos.com/uploads/shopee-logo/shopee-circle-logo-design-shopping-bag-13.png",
            "location": "Jakarta",
            "email": "shoppie@mail.com",
            "description": "Shomay is a women's clothing online shop that offers trendy and affordable fashion to women of all sizes. Our platform provides a wide selection of stylish dresses, tops, bottoms, and accessories that are perfect for any occasion. We believe that fashion should be inclusive, which is why we offer clothing in a range of sizes and styles to cater to every woman's unique fashion sense. At HerCloset, we are committed to providing exceptional customer service and ensuring that our customers have a seamless shopping experience. We offer free shipping on all orders, as well as easy returns and exchanges, so our customers can shop with confidence. Whether you're looking for the latest trends or wardrobe essentials, HerCloset has got you covered. Shop with us today and upgrade your closet with the latest fashion at affordable prices.",
            "createdAt": "2023-03-19T10:51:52.542Z",
            "updatedAt": "2023-03-19T10:51:52.542Z"
        },
        "Skills": [
            {
                "id": 6,
                "jobId": 6,
                "name": "Marketing",
                "level": "Advance",
                "createdAt": "2023-03-19T10:51:52.562Z",
                "updatedAt": "2023-03-19T10:51:52.562Z"
            }
        ],
        "updatedDate": "19 Maret 2023",
        "minimumSalaryFormatted": "25.000.000",
        "maximumSalaryFormatted": "35.000.000"
    },
    {
        "id": 7,
        "title": "Retail Manager",
        "companyId": 7,
        "minimumSalary": 8000000,
        "maximumSalary": 11000000,
        "minimumExperience": 5,
        "maximumExperience": 8,
        "postDate": "2023-03-19T00:00:00.000Z",
        "category": "Supply Chain",
        "authorId": 1,
        "jobType": "Full Time",
        "description": "Manage the day-to-day operations of our company's retail store, including sales, customer service, inventory management, and staff supervision. Develop and implement store policies and procedures to ensure a positive customer experience and optimize store performance. Recruit, train, and manage retail staff, including setting performance targets and conducting performance reviews. Analyze sales data and identify opportunities to improve store performance. Collaborate with cross-functional teams, including marketing and product management, to develop and execute store promotions and events. Ensure compliance with all health and safety regulations and standards. Write and maintain technical documentation. The ideal candidate should have a Bachelor's degree in Business, Retail Management, or a related field, and at least [Insert number] years of experience in retail management. They should have strong leadership and communication skills, excellent problem-solving skills, as well as experience with inventory management systems and retail operations. The candidate should be able to demonstrate a successful track record of driving store performance, improving customer satisfaction, and managing retail staff.",
        "createdAt": "2023-03-19T10:51:52.550Z",
        "updatedAt": "2023-03-19T10:51:52.550Z",
        "User": {
            "id": 1,
            "username": "admin1",
            "email": "admin@mail.com",
            "role": null,
            "address": "Jakarta",
            "createdAt": "2023-03-19T10:51:52.450Z",
            "updatedAt": "2023-03-19T10:51:52.450Z"
        },
        "Company": {
            "id": 7,
            "name": "Alfamale",
            "companyLogo": "https://upload.wikimedia.org/wikipedia/commons/9/9e/ALFAMART_LOGO_BARU.png",
            "location": "Semarang",
            "email": "alfa@mail.com",
            "description": "we are ordinary store with AC",
            "createdAt": "2023-03-19T10:51:52.542Z",
            "updatedAt": "2023-03-19T10:51:52.542Z"
        },
        "Skills": [
            {
                "id": 7,
                "jobId": 7,
                "name": "Management",
                "level": "Intermediate",
                "createdAt": "2023-03-19T10:51:52.562Z",
                "updatedAt": "2023-03-19T10:51:52.562Z"
            }
        ],
        "updatedDate": "19 Maret 2023",
        "minimumSalaryFormatted": "8.000.000",
        "maximumSalaryFormatted": "11.000.000"
    },
    {
        "id": 8,
        "title": "Driver",
        "companyId": 1,
        "minimumSalary": 4500000,
        "maximumSalary": 8000000,
        "minimumExperience": 0,
        "maximumExperience": 5,
        "postDate": "2023-03-19T00:00:00.000Z",
        "category": "Operation",
        "authorId": 1,
        "jobType": "Contract",
        "description": "Drive and operate a taxi to transport passengers to their destinations. Use a mobile app to receive ride requests and manage routes. Provide excellent customer service to passengers, including helping with luggage and ensuring a safe and comfortable ride. Maintain cleanliness and proper maintenance of the taxi. Handle cash and electronic payments from passengers. Follow traffic laws and regulations, and ensure safe driving practices at all times. Write and maintain technical documentation. The ideal candidate should have a valid driver's license and a clean driving record, as well as a smartphone with internet access. They should have excellent customer service and communication skills, as well as a good knowledge of local streets and landmarks. The candidate should be able to demonstrate a safe driving history, punctuality, and reliability. They should also be able to work flexible hours, including weekends and holidays.",
        "createdAt": "2023-03-19T10:51:52.550Z",
        "updatedAt": "2023-03-19T10:51:52.550Z",
        "User": {
            "id": 1,
            "username": "admin1",
            "email": "admin@mail.com",
            "role": null,
            "address": "Jakarta",
            "createdAt": "2023-03-19T10:51:52.450Z",
            "updatedAt": "2023-03-19T10:51:52.450Z"
        },
        "Company": {
            "id": 1,
            "name": "Goceng",
            "companyLogo": "https://1.bp.blogspot.com/-DCZPTZhbuOw/YIJtfI43UlI/AAAAAAAACj0/Ky5ZU0Kb7woucb0cgHMkn6MVpXZmgogeACNcBGAsYHQ/s2048/Gojek.png",
            "location": "Bandung",
            "email": "goceng@mail.com",
            "description": "Goceng is a leading provider of online taxi, food delivery, and package delivery services, serving millions of customers across the globe. Our platform connects riders with drivers in real-time, making it easy and convenient to get where you need to go. Our food delivery service allows customers to order food from their favorite local restaurants and have it delivered right to their doorstep. And our package delivery service provides fast and reliable shipping for businesses and individuals alike. We pride ourselves on providing high-quality services that are affordable, convenient, and safe. Our mission is to make transportation and delivery services accessible to everyone, no matter where they are in the world.",
            "createdAt": "2023-03-19T10:51:52.542Z",
            "updatedAt": "2023-03-19T10:51:52.542Z"
        },
        "Skills": [
            {
                "id": 10,
                "jobId": 8,
                "name": "Driving",
                "level": "Intermediate",
                "createdAt": "2023-03-19T10:51:52.562Z",
                "updatedAt": "2023-03-19T10:51:52.562Z"
            }
        ],
        "updatedDate": "19 Maret 2023",
        "minimumSalaryFormatted": "4.500.000",
        "maximumSalaryFormatted": "8.000.000"
    },
    {
        "id": 10,
        "title": "Data Engineer",
        "companyId": 7,
        "minimumSalary": 15000000,
        "maximumSalary": 20000000,
        "minimumExperience": 4,
        "maximumExperience": 8,
        "postDate": "2023-03-19T00:00:00.000Z",
        "category": "Technology",
        "authorId": 1,
        "jobType": "Full Time",
        "description": "Design, build and maintain data pipelines and data infrastructure to support data-driven decision making. Collaborate with data scientists, analysts, and other cross-functional teams to understand data needs and requirements. Collect, process, and cleanse large data sets to ensure data quality and reliability. Develop and implement data modeling and storage solutions to support scalable data processing and analysis. Design and optimize data processing workflows and systems to ensure efficiency and accuracy. Write and maintain technical documentation. The ideal candidate should have a Bachelor's or Master's degree in Computer Science, Data Science, or a related field, and at least [Insert number] years of experience in data engineering or a related field. They should have strong programming skills in languages such as Python, Java, or Scala, as well as experience with data processing frameworks such as Spark, Hadoop, or Flink. The candidate should also have experience with SQL and NoSQL databases, data modeling, and ETL processes. They should have a good understanding of distributed systems, cloud computing platforms, and software engineering best practices. The candidate should be able to demonstrate a successful track record of designing and building scalable data processing systems, as well as experience with data warehousing and data management solutions.",
        "createdAt": "2023-03-19T10:51:52.551Z",
        "updatedAt": "2023-03-19T10:51:52.551Z",
        "User": {
            "id": 1,
            "username": "admin1",
            "email": "admin@mail.com",
            "role": null,
            "address": "Jakarta",
            "createdAt": "2023-03-19T10:51:52.450Z",
            "updatedAt": "2023-03-19T10:51:52.450Z"
        },
        "Company": {
            "id": 7,
            "name": "Alfamale",
            "companyLogo": "https://upload.wikimedia.org/wikipedia/commons/9/9e/ALFAMART_LOGO_BARU.png",
            "location": "Semarang",
            "email": "alfa@mail.com",
            "description": "we are ordinary store with AC",
            "createdAt": "2023-03-19T10:51:52.542Z",
            "updatedAt": "2023-03-19T10:51:52.542Z"
        },
        "Skills": [
            {
                "id": 11,
                "jobId": 10,
                "name": "Management",
                "level": "Advance",
                "createdAt": "2023-03-19T10:51:52.562Z",
                "updatedAt": "2023-03-19T10:51:52.562Z"
            },
            {
                "id": 12,
                "jobId": 10,
                "name": "Business",
                "level": "Intermediate",
                "createdAt": "2023-03-19T10:51:52.562Z",
                "updatedAt": "2023-03-19T10:51:52.562Z"
            },
            {
                "id": 13,
                "jobId": 10,
                "name": "Engineering",
                "level": "Advance",
                "createdAt": "2023-03-19T10:51:52.562Z",
                "updatedAt": "2023-03-19T10:51:52.562Z"
            }
        ],
        "updatedDate": "19 Maret 2023",
        "minimumSalaryFormatted": "15.000.000",
        "maximumSalaryFormatted": "20.000.000"
    },
    {
        "id": 12,
        "title": "Instructor",
        "companyId": 3,
        "minimumSalary": 1000000,
        "maximumSalary": 52000000,
        "minimumExperience": 1,
        "maximumExperience": 5,
        "postDate": "2023-03-19T00:00:00.000Z",
        "category": "IT",
        "authorId": 1,
        "jobType": "Full Time",
        "description": "Instruct and mentor students in a bootcamp setting to develop technical skills in programming, data analysis, or other related fields. Deliver engaging and interactive lectures, workshops, and hands-on exercises to facilitate student learning. Provide guidance and mentorship to students, including reviewing their code and providing feedback. Collaborate with other instructors and support staff to develop and improve curriculum and teaching methodologies. Stay up-to-date with the latest trends and technologies in the field and incorporate them into the curriculum as appropriate. Write and maintain technical documentation. The ideal candidate should have a Bachelor's or Master's degree in Computer Science or a related field, and at least [Insert number] years of experience in the tech industry or a related field. They should have strong technical skills in programming languages such as Python, JavaScript, or Java, as well as experience with data analysis tools and databases. The candidate should have excellent communication and presentation skills, as well as experience with teaching or mentoring students in a technical setting. They should be passionate about technology and have a desire to share their knowledge and expertise with others. The candidate should be able to demonstrate a successful track record of delivering high-quality instruction and mentoring to students, as well as experience with curriculum development and instructional design.",
        "createdAt": "2023-03-19T10:51:52.551Z",
        "updatedAt": "2023-03-19T10:51:52.551Z",
        "User": {
            "id": 1,
            "username": "admin1",
            "email": "admin@mail.com",
            "role": null,
            "address": "Jakarta",
            "createdAt": "2023-03-19T10:51:52.450Z",
            "updatedAt": "2023-03-19T10:51:52.450Z"
        },
        "Company": {
            "id": 3,
            "name": "Bukalapar",
            "companyLogo": "https://companieslogo.com/img/orig/BUKA.JK-25d1a629.png?t=1651810819",
            "location": "Jakarta",
            "email": "buka@mail.com",
            "description": "Bukalapar is an e-commerce platform that offers a simple and user-friendly solution for businesses of all sizes to sell their products online. With Shopify, businesses can easily create their own customizable online store, and we provide a range of features and tools to help them manage their store, handle orders, and process payments. In addition, we offer various marketing and analytics tools to help businesses boost their online presence and attract new customers. At Shopify, we are committed to democratizing e-commerce and helping businesses of all sizes succeed in the digital world. Whether you are a budding entrepreneur or a well-established business, Shopify is here to assist you in achieving your online selling goals.",
            "createdAt": "2023-03-19T10:51:52.542Z",
            "updatedAt": "2023-03-19T10:51:52.542Z"
        },
        "Skills": [
            {
                "id": 14,
                "jobId": 12,
                "name": "Phyton",
                "level": "Advance",
                "createdAt": "2023-03-19T10:51:52.562Z",
                "updatedAt": "2023-03-19T10:51:52.562Z"
            }
        ],
        "updatedDate": "19 Maret 2023",
        "minimumSalaryFormatted": "1.000.000",
        "maximumSalaryFormatted": "52.000.000"
    },
    {
        "id": 11,
        "title": "Data Engineer",
        "companyId": 1,
        "minimumSalary": 15000000,
        "maximumSalary": 20000000,
        "minimumExperience": 4,
        "maximumExperience": 8,
        "postDate": "2023-03-19T00:00:00.000Z",
        "category": "Technology",
        "authorId": 1,
        "jobType": "Full Time",
        "description": "Design, build and maintain data pipelines and data infrastructure to support data-driven decision making. Collaborate with data scientists, analysts, and other cross-functional teams to understand data needs and requirements. Collect, process, and cleanse large data sets to ensure data quality and reliability. Develop and implement data modeling and storage solutions to support scalable data processing and analysis. Design and optimize data processing workflows and systems to ensure efficiency and accuracy. Write and maintain technical documentation. The ideal candidate should have a Bachelor's or Master's degree in Computer Science, Data Science, or a related field, and at least [Insert number] years of experience in data engineering or a related field. They should have strong programming skills in languages such as Python, Java, or Scala, as well as experience with data processing frameworks such as Spark, Hadoop, or Flink. The candidate should also have experience with SQL and NoSQL databases, data modeling, and ETL processes. They should have a good understanding of distributed systems, cloud computing platforms, and software engineering best practices. The candidate should be able to demonstrate a successful track record of designing and building scalable data processing systems, as well as experience with data warehousing and data management solutions.",
        "createdAt": "2023-03-19T10:51:52.551Z",
        "updatedAt": "2023-03-19T11:05:34.557Z",
        "User": {
            "id": 1,
            "username": "admin1",
            "email": "admin@mail.com",
            "role": null,
            "address": "Jakarta",
            "createdAt": "2023-03-19T10:51:52.450Z",
            "updatedAt": "2023-03-19T10:51:52.450Z"
        },
        "Company": {
            "id": 1,
            "name": "Goceng",
            "companyLogo": "https://1.bp.blogspot.com/-DCZPTZhbuOw/YIJtfI43UlI/AAAAAAAACj0/Ky5ZU0Kb7woucb0cgHMkn6MVpXZmgogeACNcBGAsYHQ/s2048/Gojek.png",
            "location": "Bandung",
            "email": "goceng@mail.com",
            "description": "Goceng is a leading provider of online taxi, food delivery, and package delivery services, serving millions of customers across the globe. Our platform connects riders with drivers in real-time, making it easy and convenient to get where you need to go. Our food delivery service allows customers to order food from their favorite local restaurants and have it delivered right to their doorstep. And our package delivery service provides fast and reliable shipping for businesses and individuals alike. We pride ourselves on providing high-quality services that are affordable, convenient, and safe. Our mission is to make transportation and delivery services accessible to everyone, no matter where they are in the world.",
            "createdAt": "2023-03-19T10:51:52.542Z",
            "updatedAt": "2023-03-19T10:51:52.542Z"
        },
        "Skills": [
            {
                "id": 15,
                "jobId": 11,
                "name": "SQL",
                "level": "Advance",
                "createdAt": "2023-03-19T11:05:34.574Z",
                "updatedAt": "2023-03-19T11:05:34.574Z"
            }
        ],
        "updatedDate": "19 Maret 2023",
        "minimumSalaryFormatted": "15.000.000",
        "maximumSalaryFormatted": "20.000.000"
    },
    {
        "id": 9,
        "title": "Engineering Manager",
        "companyId": 2,
        "minimumSalary": 40000000,
        "maximumSalary": 60000000,
        "minimumExperience": 8,
        "maximumExperience": 15,
        "postDate": "2023-03-19T00:00:00.000Z",
        "category": "Technology",
        "authorId": 1,
        "jobType": "Full Time",
        "description": "Lead and manage a team of IT engineers to design, develop, and maintain software systems and infrastructure. Collaborate with cross-functional teams, including product management, data science, and operations, to deliver high-quality software products and services. Define and implement software development processes and best practices to ensure quality and efficiency. Manage and prioritize team workloads and provide mentorship and career development for team members. Conduct performance evaluations and provide feedback and coaching to team members. Write and maintain technical documentation. The ideal candidate should have a Bachelor's or Master's degree in Computer Science or a related field, and at least [Insert number] years of experience in software engineering and management. They should have strong leadership and communication skills, excellent problem-solving skills, and a good understanding of software development methodologies and tools. The candidate should be able to demonstrate a successful track record of delivering software products and services on-time and within budget, as well as experience with agile development methodologies and cloud computing platforms. They should also have experience with software development languages such as Java, Python, or JavaScript, and familiarity with database systems and software architecture patterns.",
        "createdAt": "2023-03-19T10:51:52.551Z",
        "updatedAt": "2023-03-19T11:06:04.161Z",
        "User": {
            "id": 1,
            "username": "admin1",
            "email": "admin@mail.com",
            "role": null,
            "address": "Jakarta",
            "createdAt": "2023-03-19T10:51:52.450Z",
            "updatedAt": "2023-03-19T10:51:52.450Z"
        },
        "Company": {
            "id": 2,
            "name": "Tokovids",
            "companyLogo": "https://assets.tokopedia.net/assets-tokopedia-lite/v2/arael/kratos/36c1015e.png",
            "location": "Jakarta",
            "email": "toko@mail.com",
            "description": "We are an online shop unicorn that provides an easy-to-use platform for businesses of all sizes to sell their products online. Our platform allows businesses to create and customize their own online store with just a few clicks, and we provide a range of tools and features to help them manage their store, process orders, and accept payments. We also offer a range of marketing and analytics tools to help businesses grow their online presence and reach new customers. Our mission is to make e-commerce accessible to everyone, and we're passionate about helping businesses of all sizes succeed in the digital world. Whether you're just starting out or looking to take your business to the next level, Shopify is here to help you succeed.",
            "createdAt": "2023-03-19T10:51:52.542Z",
            "updatedAt": "2023-03-21T06:14:00.333Z"
        },
        "Skills": [
            {
                "id": 16,
                "jobId": 9,
                "name": "Management",
                "level": "Advance",
                "createdAt": "2023-03-19T11:06:04.166Z",
                "updatedAt": "2023-03-19T11:06:04.166Z"
            },
            {
                "id": 17,
                "jobId": 9,
                "name": "Software Architecture",
                "level": "Advance",
                "createdAt": "2023-03-19T11:06:04.166Z",
                "updatedAt": "2023-03-19T11:06:04.166Z"
            }
        ],
        "updatedDate": "19 Maret 2023",
        "minimumSalaryFormatted": "40.000.000",
        "maximumSalaryFormatted": "60.000.000"
    },
    {
        "id": 1,
        "title": "Backend Developers",
        "companyId": 1,
        "minimumSalary": 8000000,
        "maximumSalary": 11000000,
        "minimumExperience": 1,
        "maximumExperience": 3,
        "postDate": "2023-03-19T00:00:00.000Z",
        "category": "Technology",
        "authorId": 1,
        "jobType": "Full Time",
        "description": "Design and develop backend systems to support our web applications. Write clean and efficient code that meets the project requirements. Collaborate with cross-functional teams to design and implement new features. Optimize backend code for scalability and performance. Maintain and improve existing systems and applications. Write and maintain technical documentation. The ideal candidate should have a Bachelor's degree in Computer Science or a related field and at least [Insert number] years of experience in backend development. They should have strong proficiency in programming languages such as Python, Java, or Ruby and experience working with databases such as MySQL, PostgreSQL, or MongoDB. Familiarity with web frameworks such as Django, Flask, or Ruby on Rails, as well as knowledge of cloud computing services such as AWS or Google Cloud Platform is a plus. The candidate should possess excellent problem-solving and analytical skills, strong communication and teamwork skills. Experience with containerization technologies such as Docker or Kubernetes, familiarity with DevOps practices and tools such as Ansible, Terraform, or Jenkins, and knowledge of message brokers such as RabbitMQ or Apache Kafka are also preferred.",
        "createdAt": "2023-03-19T10:51:52.550Z",
        "updatedAt": "2023-03-21T06:13:47.583Z",
        "User": {
            "id": 1,
            "username": "admin1",
            "email": "admin@mail.com",
            "role": null,
            "address": "Jakarta",
            "createdAt": "2023-03-19T10:51:52.450Z",
            "updatedAt": "2023-03-19T10:51:52.450Z"
        },
        "Company": {
            "id": 1,
            "name": "Goceng",
            "companyLogo": "https://1.bp.blogspot.com/-DCZPTZhbuOw/YIJtfI43UlI/AAAAAAAACj0/Ky5ZU0Kb7woucb0cgHMkn6MVpXZmgogeACNcBGAsYHQ/s2048/Gojek.png",
            "location": "Bandung",
            "email": "goceng@mail.com",
            "description": "Goceng is a leading provider of online taxi, food delivery, and package delivery services, serving millions of customers across the globe. Our platform connects riders with drivers in real-time, making it easy and convenient to get where you need to go. Our food delivery service allows customers to order food from their favorite local restaurants and have it delivered right to their doorstep. And our package delivery service provides fast and reliable shipping for businesses and individuals alike. We pride ourselves on providing high-quality services that are affordable, convenient, and safe. Our mission is to make transportation and delivery services accessible to everyone, no matter where they are in the world.",
            "createdAt": "2023-03-19T10:51:52.542Z",
            "updatedAt": "2023-03-19T10:51:52.542Z"
        },
        "Skills": [
            {
                "id": 1,
                "jobId": 1,
                "name": "Javascript",
                "level": "Beginner",
                "createdAt": "2023-03-19T10:51:52.562Z",
                "updatedAt": "2023-03-19T10:51:52.562Z"
            },
            {
                "id": 8,
                "jobId": 1,
                "name": "MongoDB",
                "level": "Intermediate",
                "createdAt": "2023-03-19T10:51:52.562Z",
                "updatedAt": "2023-03-19T10:51:52.562Z"
            }
        ],
        "updatedDate": "21 Maret 2023",
        "minimumSalaryFormatted": "8.000.000",
        "maximumSalaryFormatted": "11.000.000"
    }
]